{
    "version": "https://jsonfeed.org/version/1",
    "title": "frw-find-retain-wow",
    "description": "",
    "home_page_url": "https://therealmccoy.github.io/find-retain-wow",
    "feed_url": "https://therealmccoy.github.io/find-retain-wow/feed.json",
    "user_comment": "",
    "author": {
        "name": "abhishek rai"
    },
    "items": [
        {
            "id": "https://therealmccoy.github.io/find-retain-wow/im-the-technical-founder-of-a-b2b-saas-startup-what-is-a-good-sales-training-course-i-can-take-to-better-understand-software-sales/",
            "url": "https://therealmccoy.github.io/find-retain-wow/im-the-technical-founder-of-a-b2b-saas-startup-what-is-a-good-sales-training-course-i-can-take-to-better-understand-software-sales/",
            "title": "I&#x27;m the technical founder of a B2B SaaS startup. What is a good sales training course I can take to better understand software sales?",
            "content_html": "<p><a href=\"https://www.quora.com/Im-the-technical-founder-of-a-B2B-SaaS-startup-What-is-a-good-sales-training-course-I-can-take-to-better-understand-software-sales\">I'm the technical founder of a B2B SaaS startup. What is a good sales training course I can take to better understand software sales?</a></p>\n<p>Let us try to resolve this question asked on Quora.</p>\n<p>Let us ask another question in a little different manner to the gentleman who asked this question:</p>\n<blockquote>\n<p>I'm a non-technical founder of a B2B Saas startup, how do I understand the intricasies of  code deployed at my company?</p>\n</blockquote>\n<p>Well, the answer could be simple and a long one, most probably outlining a path towards learning programming and then slowly graduating on to more complex things.</p>\n<p>In the similar vein, there is only one way to understand sales process, be it in any industry.</p>\n<p class=\"msg msg--highlight \">Start selling...</p>\n<p class=\"msg msg--info\">The step to begin with would be :</p>\n<ol>\n<li>Do a research of your landscape, exiting solutions and competitors as well.</li>\n<li>Make a list of probable prospects (companies) to be pitched of your innovative solution.</li>\n<li>Find out the CXOs email address.</li>\n<li>Write a personal and engaging copy with a good subject line, pitching your product to each of the prospect.</li>\n<li>Wait for the reverts and their reactions.</li>\n<li>Put the reverts received/not-recieved into three baskets:\n<ol style=\"list-style-type: lower-roman;\">\n<li>RED: Reply not received. Re-tooling of the copy and subject line required through better research.</li>\n<li>ORANGE: Not interested. More research and follow-up required.</li>\n<li>GREEN: Interested. Secure a demo.</li>\n</ol>\n</li>\n<li>Go back to 1</li>\n</ol>\n<p>This way, you would receive a far greater understanding of the entire B2B sales process, than any course can deliver.</p>\n<p>Once you have worked this way, for a couple of years, do look for an offline/online reputed course, which could compliment your practical experience of past two years.</p>\n<p>Now, when you would enroll in a sales course, since you have practical experience, you could co-relate what is being taught, to what you have exprienced already and be able to connect the dots.</p>\n<p>Most probably, you might not need the course any more...</p>\n<p class=\"msg msg--success\"><strong>PS:</strong> If I could help you more in any way, please feel free to reach out to me, via comment or email.</p>",
            "image": "https://therealmccoy.github.io/find-retain-wow/media/posts/2/pexels-photo-618158.jpeg",
            "author": {
                "name": "abhishek rai"
            },
            "tags": [
                   "Saas",
                   "SaaSStartup",
                   "B2BSales"
            ],
            "date_published": "2018-03-27T06:50:09+05:30",
            "date_modified": "2018-03-27T06:58:10+05:30"
        },
        {
            "id": "https://therealmccoy.github.io/find-retain-wow/what-is-find-retain-wow/",
            "url": "https://therealmccoy.github.io/find-retain-wow/what-is-find-retain-wow/",
            "title": "What is &#x27;Find, Retain, Wow&#x27;?",
            "content_html": "<p>During last decade or so, the techonlogical barrier to start a startup has considerably come down. No need to have your own servers, set-up data-centers, hosting etc.</p>\n<p>And then came social media and this <em>'viral'</em> pehomenon, and suddenly one could be a <em>'overnight success'</em>.</p>\n<p>But over a period of time, it is becoming more and more difficult for a new startup to get customers. The reason is simple, the things which made starting a startup simple, has now given the customer a big basket of choices to choose from. Not mentioning, ever decreasing short attention time.</p>\n<p class=\"msg msg--highlight \"><strong>Things have come to such pass that 'attention' has become the biggest obstacle of building a successful startup, ie getting the attention of your customer! </strong></p>\n<p>Perhaps it could be even said that the resources in terms of both time and money which were earlier deployed for just starting a startup, are now being deployed to get the first bunch of customers. In some cases, many folds over.</p>\n<p>The reason now for which the startups are not succeeding is not 'not having the technology' but 'not having the customers'.</p>\n<p>A few decades back, it was said about the customers that '<em>If you build for them, they will come to you' </em>because the entire <em>'building' </em>stuff was the challenge.</p>\n<p class=\"msg msg--highlight \">Now the above statement could be very well rephrased as <em>'If you build for them, you still have to find them'</em></p>\n<p>Find, Retain, Wow aims to be that place, which could solve your queries regarding how to find the first bunch of customers for your startup, what you are doing right and what you are doing not so right in your startup sales and from there on we move to how to retain your customers in this ultra-competitive environment and then to keep them for the life-time, by delivering a 'wow' experience!</p>\n<p>You can email your specific queries or post comments on this blog's post regarding the same.</p>\n<p class=\"msg msg--highlight \"><strong>'<em>Amat Victoria Curam</em>' which means 'Victory loves preparation.</strong></p>\n<p>Find, Retain, Wow helps you prepare for your startup victory by guiding you through your company's entire sales set-up and process.</p>\n<p><strong>Saddle up, lock and load!</strong></p>",
            "image": "https://therealmccoy.github.io/find-retain-wow/media/posts/1/pexels-photo-751073.jpeg",
            "author": {
                "name": "abhishek rai"
            },
            "tags": [
                   "startupsales",
                   "startup",
                   "sales"
            ],
            "date_published": "2018-03-26T05:43:24+05:30",
            "date_modified": "2018-03-27T06:57:54+05:30"
        }
    ]
}
